Tekla Open API Reference for Tekla Structures 2025
DrawingItem.Export Method
 Exports the drawing item in the catalog to given file name. If path is not given drawing is exported to model folder. If filename is empty drawing name is used as filename.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Export(
	ref string filename
)
Public Function Export (
	ByRef filename As String
) As Boolean
Parameters
filename
Type: System.String
The export file name of the drawing item.
Return Value
Type: Boolean
True on success.
Examples
using System;
using Tekla.Structures.Catalogs;
public class Example
{
       public void Example1()
       {
           DrawingItem item = new DrawingItem();
           if (item.Select())
           {
               string filename = System.IO.Path.GetTempPath() + item.Name;
               if (item.Export(ref filename))
               {
                   Console.WriteLine(item.Name + " exported successfully");
               }
           }
       }
}
See Also
Reference
DrawingItem Class
Tekla.Structures.Catalogs Namespace